#Программа, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированную последовательность
#на стандартный вывод. Кодирование должно учитывать регистр символов.
#Кодирование осуществляется следующим образом:
#s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот 
#символ и количество его повторений в этой позиции строки.

s = input()
n=1
i=0
s2=''
for dna in s:
  if i==len(s)-1:
    s2=s2+s[i]+str(n)
    break
  if dna==s[i+1]:
    n+=1
  else:
    s2=s2+s[i]+str(n)
    n=1 # сбрасываем подсчет
  i+=1
print(s2)
